jankaluza/qsimkit/CPU/Variants/msp430x44x.cpp
#ifndef TXBUF_0_
#define TXBUF_0_ 0x0077
#endif
#ifndef MC0
#define MC0 0x0010
#endif
#ifndef MPY_
#define MPY_ 0x0130
#endif
#ifndef URXSE
#define URXSE 0x08
#endif
#ifndef XCAP10PF
#define XCAP10PF 0x10
#endif
#ifndef TXBUF_1_
#define TXBUF_1_ 0x007F
#endif
#ifndef __msp430_headers_flash_h
#define __msp430_headers_flash_h 
#endif
#ifndef MSC
#define MSC 0x0080
#endif
#ifndef MSH
#define MSH 0x0080
#endif
#ifndef INCH_VCC2
#define INCH_VCC2 11
#endif
#ifndef PENA
#define PENA 0x80
#endif
#ifndef MC_UPDOWN
#define MC_UPDOWN MC_3
#endif
#ifndef __FLT_MIN__
#define __FLT_MIN__ 1.17549435e-38F
#endif
#ifndef SCFQ_512K
#define SCFQ_512K 0x0F
#endif
#ifndef P1IES_
#define P1IES_ 0x0024
#endif
#ifndef CKPH
#define CKPH 0x80
#endif
#ifndef REF2_5V
#define REF2_5V 0x0040
#endif
#ifndef CKPL
#define CKPL 0x40
#endif
#ifndef U0IE
#define U0IE IE1
#endif
#ifndef __ASSEMBLER__
#define __ASSEMBLER__ 1
#endif
#ifndef URCTL_
#define URCTL_ 0x0072
#endif
#ifndef __MSP430_HAS_PORT3__
#define __MSP430_HAS_PORT3__ 
#endif
#ifndef __CHAR_BIT__
#define __CHAR_BIT__ 8
#endif
#ifndef U1CTL_
#define U1CTL_ 0x0078
#endif
#ifndef P5DIR_
#define P5DIR_ 0x0032
#endif
#ifndef TBSSEL_ACLK
#define TBSSEL_ACLK TBSSEL_1
#endif
#ifndef SELM_DCO
#define SELM_DCO 0x00
#endif
#ifndef __MSP430_HAS_BT__
#define __MSP430_HAS_BT__ 
#endif
#ifndef U0ME
#define U0ME ME1
#endif
#ifndef SMCLKOFF
#define SMCLKOFF 0x40
#endif
#ifndef __WINT_MAX__
#define __WINT_MAX__ 65535U
#endif
#ifndef TA0R_
#define TA0R_ 0x0170
#endif
#ifndef BTCTL_
#define BTCTL_ 0x0040
#endif
#ifndef TXEPT
#define TXEPT 0x01
#endif
#ifndef CAON
#define CAON 0x08
#endif
#ifndef USART0TX_VECTOR
#define USART0TX_VECTOR 16
#endif
#ifndef __msp430_have_timerb7
#define __msp430_have_timerb7 
#endif
#ifndef SHT1_DIV384
#define SHT1_DIV384 SHT1_9
#endif
#ifndef __SIZE_MAX__
#define __SIZE_MAX__ 65535U
#endif
#ifndef U1IFG
#define U1IFG IFG2
#endif
#ifndef LCDM10_
#define LCDM10_ LCD_BASE+0xA
#endif
#ifndef __WCHAR_MAX__
#define __WCHAR_MAX__ 32767
#endif
#ifndef LCDM11_
#define LCDM11_ LCD_BASE+0xB
#endif
#ifndef SEGWRT
#define SEGWRT 0x0080
#endif
#ifndef SCFQ_256K
#define SCFQ_256K 0x07
#endif
#ifndef LCDM12_
#define LCDM12_ LCD_BASE+0xC
#endif
#ifndef __FLT_EVAL_METHOD__
#define __FLT_EVAL_METHOD__ 0
#endif
#ifndef LCDM13_
#define LCDM13_ LCD_BASE+0xD
#endif
#ifndef XT2OF
#define XT2OF 0x08
#endif
#ifndef FN0
#define FN0 0x0001
#endif
#ifndef FN1
#define FN1 0x0002
#endif
#ifndef FN2
#define FN2 0x0004
#endif
#ifndef FN3
#define FN3 0x0008
#endif
#ifndef FN4
#define FN4 0x0010
#endif
#ifndef FN5
#define FN5 0x0020
#endif
#ifndef LCDM14_
#define LCDM14_ LCD_BASE+0xE
#endif
#ifndef LCDM15_
#define LCDM15_ LCD_BASE+0xF
#endif
#ifndef SELS
#define SELS 0x04
#endif
#ifndef CM_BOTH
#define CM_BOTH CM_3
#endif
#ifndef SHT0_DIV256
#define SHT0_DIV256 SHT0_8
#endif
#ifndef XCAP0PF
#define XCAP0PF 0x00
#endif
#ifndef LCDM16_
#define LCDM16_ LCD_BASE+0x10
#endif
#ifndef UTCTL0_
#define UTCTL0_ 0x0071
#endif
#ifndef CAIES
#define CAIES 0x04
#endif
#ifndef LCDM17_
#define LCDM17_ LCD_BASE+0x11
#endif
#ifndef UTCTL1_
#define UTCTL1_ 0x0079
#endif
#ifndef CAIFG
#define CAIFG 0x01
#endif
#ifndef LCDM18_
#define LCDM18_ LCD_BASE+0x12
#endif
#ifndef __FINITE_MATH_ONLY__
#define __FINITE_MATH_ONLY__ 0
#endif
#ifndef LCDM19_
#define LCDM19_ LCD_BASE+0x13
#endif
#ifndef SHT02
#define SHT02 0x0400
#endif
#ifndef __GNUC_PATCHLEVEL__
#define __GNUC_PATCHLEVEL__ 3
#endif
#ifndef XCAP14PF
#define XCAP14PF 0x20
#endif
#ifndef UTCTL_0_
#define UTCTL_0_ 0x0071
#endif
#ifndef TBCTL_
#define TBCTL_ 0x0180
#endif
#ifndef RESHI_
#define RESHI_ 0x013C
#endif
#ifndef FSSEL0
#define FSSEL0 0x0040
#endif
#ifndef FSSEL1
#define FSSEL1 0x0080
#endif
#ifndef P4DIR_
#define P4DIR_ 0x001E
#endif
#ifndef __DEC64_MAX_EXP__
#define __DEC64_MAX_EXP__ 385
#endif
#ifndef P2CA0
#define P2CA0 0x04
#endif
#ifndef P2CA1
#define P2CA1 0x08
#endif
#ifndef UART1TX_VECTOR
#define UART1TX_VECTOR USART1TX_VECTOR
#endif
#ifndef ADC12CTL0_
#define ADC12CTL0_ 0x01A0
#endif
#ifndef __SHRT_MAX__
#define __SHRT_MAX__ 32767
#endif
#ifndef __LDBL_MAX__
#define __LDBL_MAX__ 3.40282347e+38L
#endif
#ifndef BIT0
#define BIT0 0x0001
#endif
#ifndef BIT1
#define BIT1 0x0002
#endif
#ifndef BIT2
#define BIT2 0x0004
#endif
#ifndef BIT3
#define BIT3 0x0008
#endif
#ifndef BIT4
#define BIT4 0x0010
#endif
#ifndef BIT5
#define BIT5 0x0020
#endif
#ifndef BIT7
#define BIT7 0x0080
#endif
#ifndef BIT8
#define BIT8 0x0100
#endif
#ifndef BIT9
#define BIT9 0x0200
#endif
#ifndef LCD_BASE
#define LCD_BASE 0x90
#endif
#ifndef BITA
#define BITA 0x0400
#endif
#ifndef BITB
#define BITB 0x0800
#endif
#ifndef BITC
#define BITC 0x1000
#endif
#ifndef BITD
#define BITD 0x2000
#endif
#ifndef BITE
#define BITE 0x4000
#endif
#ifndef BITF
#define BITF 0x8000
#endif
#ifndef BT_fCLK2_DIV2
#define BT_fCLK2_DIV2 0
#endif
#ifndef __UINTMAX_TYPE__
#define __UINTMAX_TYPE__ long long unsigned int
#endif
#ifndef CHAR
#define CHAR 0x10
#endif
#ifndef WDTCNTCL
#define WDTCNTCL 0x0008
#endif
#ifndef __DEC32_EPSILON__
#define __DEC32_EPSILON__ 1E-6DF
#endif
#ifndef TAIV_CCR2
#define TAIV_CCR2 0x04
#endif
#ifndef CCTL0_
#define CCTL0_ TA0CCTL0_
#endif
#ifndef MPYS_
#define MPYS_ 0x0132
#endif
#ifndef ADC12IFG_
#define ADC12IFG_ 0x01A4
#endif
#ifndef UMCTL_
#define UMCTL_ 0x0073
#endif
#ifndef CCTL1_
#define CCTL1_ TA0CCTL1_
#endif
#ifndef SVSFG
#define SVSFG 0x01
#endif
#ifndef __LDBL_MAX_EXP__
#define __LDBL_MAX_EXP__ 128
#endif
#ifndef RXERR
#define RXERR 0x01
#endif
#ifndef CCTL2_
#define CCTL2_ TA0CCTL2_
#endif
#ifndef __WINT_MIN__
#define __WINT_MIN__ 0U
#endif
#ifndef SELM_A
#define SELM_A 0x18
#endif
#ifndef U1TXBUF_
#define U1TXBUF_ 0x007F
#endif
#ifndef TBIV_NONE
#define TBIV_NONE 0x00
#endif
#ifndef P3IN_
#define P3IN_ 0x0018
#endif
#ifndef __SCHAR_MAX__
#define __SCHAR_MAX__ 127
#endif
#ifndef P2IFG_
#define P2IFG_ 0x002B
#endif
#ifndef UTCTL_1_
#define UTCTL_1_ 0x0079
#endif
#ifndef TASSEL_ACLK
#define TASSEL_ACLK TASSEL_1
#endif
#ifndef TACTL_
#define TACTL_ TA0CTL_
#endif
#ifndef CCR0_
#define CCR0_ TA0CCR0_
#endif
#ifndef __DBL_DIG__
#define __DBL_DIG__ 6
#endif
#ifndef CCR1_
#define CCR1_ TA0CCR1_
#endif
#ifndef P3DIR_
#define P3DIR_ 0x001A
#endif
#ifndef DCOF
#define DCOF 0x01
#endif
#ifndef CCR2_
#define CCR2_ TA0CCR2_
#endif
#ifndef LCDCTL_
#define LCDCTL_ LCD_BASE
#endif
#ifndef __SIZEOF_INT__
#define __SIZEOF_INT__ 2
#endif
#ifndef __SIZEOF_POINTER__
#define __SIZEOF_POINTER__ 2
#endif
#ifndef SVSON
#define SVSON 0x04
#endif
#ifndef URCTL_0_
#define URCTL_0_ 0x0072
#endif
#ifndef SVSOP
#define SVSOP 0x02
#endif
#ifndef ADC12MCTL12_
#define ADC12MCTL12_ 0x008C
#endif
#ifndef SELM0
#define SELM0 0x08
#endif
#ifndef SELM1
#define SELM1 0x10
#endif
#ifndef RXBUF_
#define RXBUF_ 0x0076
#endif
#ifndef TACCTL1_
#define TACCTL1_ TA0CCTL1_
#endif
#ifndef U1MCTL_
#define U1MCTL_ 0x007B
#endif
#ifndef URCTL_1_
#define URCTL_1_ 0x007A
#endif
#ifndef XCAP18PF
#define XCAP18PF 0x30
#endif
#ifndef CAP
#define CAP 0x0100
#endif
#ifndef TBIFG
#define TBIFG 0x0001
#endif
#ifndef P6SEL_
#define P6SEL_ 0x0037
#endif
#ifndef __USER_LABEL_PREFIX__
#define __USER_LABEL_PREFIX__ 
#endif
#ifndef SHT1_DIV16
#define SHT1_DIV16 SHT1_2
#endif
#ifndef ADC12SSEL_ACLK
#define ADC12SSEL_ACLK ADC12SSEL_1
#endif
#ifndef CCI
#define CCI 0x0008
#endif
#ifndef SHT1_DIV32
#define SHT1_DIV32 SHT1_3
#endif
#ifndef __STDC_HOSTED__
#define __STDC_HOSTED__ 1
#endif
#ifndef __LDBL_HAS_INFINITY__
#define __LDBL_HAS_INFINITY__ 1
#endif
#ifndef OUTMOD_RESET_SET
#define OUTMOD_RESET_SET OUTMOD_7
#endif
#ifndef __msp430_headers_mpy_h
#define __msp430_headers_mpy_h 
#endif
#ifndef TASSEL_TACLK
#define TASSEL_TACLK TASSEL_0
#endif
#ifndef SHT1_DIV64
#define SHT1_DIV64 SHT1_4
#endif
#ifndef ID_DIV1
#define ID_DIV1 ID_0
#endif
#ifndef ID_DIV2
#define ID_DIV2 ID_1
#endif
#ifndef ID_DIV4
#define ID_DIV4 ID_2
#endif
#ifndef ID_DIV8
#define ID_DIV8 ID_3
#endif
#ifndef TACLR
#define TACLR 0x0004
#endif
#ifndef SHT0_DIV384
#define SHT0_DIV384 SHT0_9
#endif
#ifndef RESLO_
#define RESLO_ 0x013A
#endif
#ifndef __FLT_EPSILON__
#define __FLT_EPSILON__ 1.19209290e-7F
#endif
#ifndef MERAS
#define MERAS 0x0004
#endif
#ifndef WDTNMI
#define WDTNMI 0x0020
#endif
#ifndef __MSP430__
#define __MSP430__ 1
#endif
#ifndef ADC12MCTL_
#define ADC12MCTL_ 0x0080
#endif
#ifndef RXWAKE
#define RXWAKE 0x02
#endif
#ifndef SHT1_DIV96
#define SHT1_DIV96 SHT1_5
#endif
#ifndef __LDBL_MIN__
#define __LDBL_MIN__ 1.17549435e-38L
#endif
#ifndef ADC12ON
#define ADC12ON 0x0010
#endif
#ifndef CAEX
#define CAEX 0x80
#endif
#ifndef __msp430_headers_system_clock_h
#define __msp430_headers_system_clock_h 
#endif
#ifndef P6IN_
#define P6IN_ 0x0034
#endif
#ifndef EMEX
#define EMEX 0x0020
#endif
#ifndef __DEC32_MAX__
#define __DEC32_MAX__ 9.999999E96DF
#endif
#ifndef CM0
#define CM0 0x4000
#endif
#ifndef CM1
#define CM1 0x8000
#endif
#ifndef ADC12DIV0
#define ADC12DIV0 0x0020
#endif
#ifndef ADC12DIV1
#define ADC12DIV1 0x0040
#endif
#ifndef ADC12DIV2
#define ADC12DIV2 0x0080
#endif
#ifndef P1IFG_
#define P1IFG_ 0x0023
#endif
#ifndef INCH_VEREF_PLUS
#define INCH_VEREF_PLUS 8
#endif
#ifndef ADC12SC
#define ADC12SC 0x0001
#endif
#ifndef CAIE
#define CAIE 0x02
#endif
#ifndef COV
#define COV 0x0002
#endif
#ifndef TBCCTL6_
#define TBCCTL6_ 0x018E
#endif
#ifndef OUTMOD_TOGGLE
#define OUTMOD_TOGGLE OUTMOD_4
#endif
#ifndef TACTL
#define TACTL TA0CTL
#endif
#ifndef __SIZEOF_LONG__
#define __SIZEOF_LONG__ 4
#endif
#ifndef UART0TX_VECTOR
#define UART0TX_VECTOR USART0TX_VECTOR
#endif
#ifndef VLDON
#define VLDON 0x10
#endif
#ifndef SCFQ_M
#define SCFQ_M 0x80
#endif
#ifndef P5OUT_
#define P5OUT_ 0x0031
#endif
#ifndef __DECIMAL_DIG__
#define __DECIMAL_DIG__ 9
#endif
#ifndef TBIV_
#define TBIV_ 0x011E
#endif
#ifndef FWKEY
#define FWKEY 0xA500
#endif
#ifndef __msp430_headers_adc12_h
#define __msp430_headers_adc12_h 
#endif
#ifndef SSEL0
#define SSEL0 0x10
#endif
#ifndef SSEL1
#define SSEL1 0x20
#endif
#ifndef TBIV_OVERFLOW
#define TBIV_OVERFLOW 0x0E
#endif
#ifndef P5SEL_
#define P5SEL_ 0x0033
#endif
#ifndef KEYV
#define KEYV 0x0002
#endif
#ifndef ADC12MCTL10_
#define ADC12MCTL10_ 0x008A
#endif
#ifndef __LDBL_HAS_QUIET_NAN__
#define __LDBL_HAS_QUIET_NAN__ 1
#endif
#ifndef LOCK
#define LOCK 0x0010
#endif
#ifndef __msp430_headers_svs_h
#define __msp430_headers_svs_h 
#endif
#ifndef __msp430_headers_compa_h
#define __msp430_headers_compa_h 
#endif
#ifndef ADC12MCTL11_
#define ADC12MCTL11_ 0x008B
#endif
#ifndef __GNUC__
#define __GNUC__ 4
#endif
#ifndef ADC12MCTL13_
#define ADC12MCTL13_ 0x008D
#endif
#ifndef SWRST
#define SWRST 0x01
#endif
#ifndef UMCTL1_
#define UMCTL1_ 0x007B
#endif
#ifndef ADC12MCTL14_
#define ADC12MCTL14_ 0x008E
#endif
#ifndef PORT2_VECTOR
#define PORT2_VECTOR 2
#endif
#ifndef __FLT_HAS_DENORM__
#define __FLT_HAS_DENORM__ 1
#endif
#ifndef __SIZEOF_LONG_DOUBLE__
#define __SIZEOF_LONG_DOUBLE__ 4
#endif
#ifndef U1IE
#define U1IE IE2
#endif
#ifndef CSTARTADD1
#define CSTARTADD1 0x2000
#endif
#ifndef CSTARTADD2
#define CSTARTADD2 0x4000
#endif
#ifndef CSTARTADD3
#define CSTARTADD3 0x8000
#endif
#ifndef TBSSEL_TBCLK
#define TBSSEL_TBCLK TBSSEL_0
#endif
#ifndef FSSEL_0
#define FSSEL_0 0x0000
#endif
#ifndef FSSEL_1
#define FSSEL_1 0x0040
#endif
#ifndef FSSEL_2
#define FSSEL_2 0x0080
#endif
#ifndef FSSEL_3
#define FSSEL_3 0x00C0
#endif
#ifndef ADC12MCTL15_
#define ADC12MCTL15_ 0x008F
#endif
#ifndef __msp430_have_port1
#define __msp430_have_port1 
#endif
#ifndef __msp430_have_port2
#define __msp430_have_port2 
#endif
#ifndef __msp430_have_port3
#define __msp430_have_port3 
#endif
#ifndef TBSSEL_SMCLK
#define TBSSEL_SMCLK TBSSEL_2
#endif
#ifndef __msp430_have_port5
#define __msp430_have_port5 
#endif
#ifndef __msp430_have_port6
#define __msp430_have_port6 
#endif
#ifndef ADC12MEM10_
#define ADC12MEM10_ 0x0154
#endif
#ifndef __MSP430_HAS_UART0__
#define __MSP430_HAS_UART0__ 
#endif
#ifndef __msp430_have_lcd_16_20
#define __msp430_have_lcd_16_20 
#endif
#ifndef __MSP430_HAS_PORT4__
#define __MSP430_HAS_PORT4__ 
#endif
#ifndef ADC12MEM11_
#define ADC12MEM11_ 0x0156
#endif
#ifndef __BIGGEST_ALIGNMENT__
#define __BIGGEST_ALIGNMENT__ 2
#endif
#ifndef ADC12MEM12_
#define ADC12MEM12_ 0x0158
#endif
#ifndef ADC12MEM13_
#define ADC12MEM13_ 0x015A
#endif
#ifndef U1ME
#define U1ME ME2
#endif
#ifndef LCDSG0
#define LCDSG0 0x00
#endif
#ifndef ADC12MEM14_
#define ADC12MEM14_ 0x015C
#endif
#ifndef SHT0_DIV768
#define SHT0_DIV768 SHT0_11
#endif
#ifndef BT_ADLY_0_064
#define BT_ADLY_0_064 0
#endif
#ifndef ADC12MEM15_
#define ADC12MEM15_ 0x015E
#endif
#ifndef BTRESET
#define BTRESET 0x40
#endif
#ifndef __DBL_HAS_INFINITY__
#define __DBL_HAS_INFINITY__ 1
#endif
#ifndef TACCR0_
#define TACCR0_ TA0CCR0_
#endif
#ifndef TAIE
#define TAIE 0x0002
#endif
#ifndef GIE
#define GIE 0x0008
#endif
#ifndef TAIV
#define TAIV TA0IV
#endif
#ifndef ADC12IE_
#define ADC12IE_ 0x01A6
#endif
#ifndef TACCR1_
#define TACCR1_ TA0CCR1_
#endif
#ifndef P1DIR_
#define P1DIR_ 0x0022
#endif
#ifndef BTFRFQ0
#define BTFRFQ0 0x08
#endif
#ifndef BTFRFQ1
#define BTFRFQ1 0x10
#endif
#ifndef ADC12MEM_
#define ADC12MEM_ 0x0140
#endif
#ifndef LCDM20_
#define LCDM20_ LCD_BASE+0x14
#endif
#ifndef FLL_DIV0
#define FLL_DIV0 0x01
#endif
#ifndef FLL_DIV1
#define FLL_DIV1 0x02
#endif
#ifndef WDTIS1
#define WDTIS1 0x0002
#endif
#ifndef BLKWRT
#define BLKWRT 0x0080
#endif
#ifndef TACCR2_
#define TACCR2_ TA0CCR2_
#endif
#ifndef P4OUT_
#define P4OUT_ 0x001D
#endif
#ifndef SSEL_UCLKI
#define SSEL_UCLKI SSEL_0
#endif
#ifndef SHT00
#define SHT00 0x0100
#endif
#ifndef SHT01
#define SHT01 0x0200
#endif
#ifndef SHT03
#define SHT03 0x0800
#endif
#ifndef URXWIE
#define URXWIE 0x04
#endif
#ifndef MC_CONT
#define MC_CONT MC_2
#endif
#ifndef __msp430_headers_timerb_h__
#define __msp430_headers_timerb_h__ 
#endif
#ifndef SHT10
#define SHT10 0x1000
#endif
#ifndef SHT11
#define SHT11 0x2000
#endif
#ifndef SHT12
#define SHT12 0x4000
#endif
#ifndef SHT13
#define SHT13 0x8000
#endif
#ifndef P4SEL_
#define P4SEL_ 0x001F
#endif
#ifndef ADC12MCTL0_
#define ADC12MCTL0_ ADC12MCTL_
#endif
#ifndef TAIV_NONE
#define TAIV_NONE 0x00
#endif
#ifndef BT_fLCD_1K
#define BT_fLCD_1K 0
#endif
#ifndef ADC12MCTL1_
#define ADC12MCTL1_ 0x0081
#endif
#ifndef LCDSON
#define LCDSON 0x04
#endif
#ifndef __LDBL_HAS_DENORM__
#define __LDBL_HAS_DENORM__ 1
#endif
#ifndef ADC12MCTL2_
#define ADC12MCTL2_ 0x0082
#endif
#ifndef __DEC128_MAX__
#define __DEC128_MAX__ 9.999999999999999999999999999999999E6144DL
#endif
#ifndef __USING_SJLJ_EXCEPTIONS__
#define __USING_SJLJ_EXCEPTIONS__ 1
#endif
#ifndef __DEC32_MIN__
#define __DEC32_MIN__ 1E-95DF
#endif
#ifndef SVSCTL_
#define SVSCTL_ 0x0056
#endif
#ifndef SSEL_0
#define SSEL_0 0x00
#endif
#ifndef SSEL_1
#define SSEL_1 0x10
#endif
#ifndef SSEL_3
#define SSEL_3 0x30
#endif
#ifndef ADC12MCTL4_
#define ADC12MCTL4_ 0x0084
#endif
#ifndef TAR_
#define TAR_ TA0R_
#endif
#ifndef __DBL_MAX_EXP__
#define __DBL_MAX_EXP__ 128
#endif
#ifndef ADC12MCTL5_
#define ADC12MCTL5_ 0x0085
#endif
#ifndef RXBUF_0_
#define RXBUF_0_ 0x0076
#endif
#ifndef __DEC128_EPSILON__
#define __DEC128_EPSILON__ 1E-33DL
#endif
#ifndef ISSH
#define ISSH 0x0100
#endif
#ifndef ADC12MCTL6_
#define ADC12MCTL6_ 0x0086
#endif
#ifndef RXBUF_1_
#define RXBUF_1_ 0x007E
#endif
#ifndef SCFQ_1M
#define SCFQ_1M 0x1F
#endif
#ifndef __PTRDIFF_MAX__
#define __PTRDIFF_MAX__ 2147483647L
#endif
#ifndef ADC12MCTL7_
#define ADC12MCTL7_ 0x0087
#endif
#ifndef __MSP430_HAS_WDT__
#define __MSP430_HAS_WDT__ 
#endif
#ifndef SCFQ_2M
#define SCFQ_2M 0x3F
#endif
#ifndef ADC12MCTL8_
#define ADC12MCTL8_ 0x0088
#endif
#ifndef BT_fCLK2_ACLK
#define BT_fCLK2_ACLK 0x00
#endif
#ifndef ADC12MCTL9_
#define ADC12MCTL9_ 0x0089
#endif
#ifndef UART1RX_VECTOR
#define UART1RX_VECTOR USART1RX_VECTOR
#endif
#ifndef SCFQ_4M
#define SCFQ_4M 0x7F
#endif
#ifndef TXBUF_
#define TXBUF_ 0x0077
#endif
#ifndef P6OUT_
#define P6OUT_ 0x0035
#endif
#ifndef __LONG_LONG_MAX__
#define __LONG_LONG_MAX__ 9223372036854775807LL
#endif
#ifndef TBSSEL_INCLK
#define TBSSEL_INCLK TBSSEL_3
#endif
#ifndef __SIZEOF_SIZE_T__
#define __SIZEOF_SIZE_T__ 2
#endif
#ifndef CSTARTADD0
#define CSTARTADD0 0x1000
#endif
#ifndef ADC12SSEL0
#define ADC12SSEL0 0x0008
#endif
#ifndef ADC12SSEL1
#define ADC12SSEL1 0x0010
#endif
#ifndef OUTMOD0
#define OUTMOD0 0x0020
#endif
#ifndef OUTMOD1
#define OUTMOD1 0x0040
#endif
#ifndef OUTMOD2
#define OUTMOD2 0x0080
#endif
#ifndef MSP430_NO_HWMUL
#define MSP430_NO_HWMUL 1
#endif
#ifndef ADC12IV_
#define ADC12IV_ 0x01A8
#endif
#ifndef WAIT
#define WAIT 0x0008
#endif
#ifndef __SIZEOF_WINT_T__
#define __SIZEOF_WINT_T__ 2
#endif
#ifndef FSSEL_ACLK
#define FSSEL_ACLK FSSEL_0
#endif
#ifndef IE2_
#define IE2_ 0x0001
#endif
#ifndef UMCTL0_
#define UMCTL0_ 0x0073
#endif
#ifndef URXEIE
#define URXEIE 0x08
#endif
#ifndef P3OUT_
#define P3OUT_ 0x0019
#endif
#ifndef __GXX_ABI_VERSION
#define __GXX_ABI_VERSION 1002
#endif
#ifndef BIT6
#define BIT6 0x0040
#endif
#ifndef __msp430_headers_timera_h__
#define __msp430_headers_timera_h__ 
#endif
#ifndef SHS_TACCR1
#define SHS_TACCR1 SHS_1
#endif
#ifndef TASSEL0
#define TASSEL0 0x0100
#endif
#ifndef TASSEL1
#define TASSEL1 0x0200
#endif
#ifndef TASSEL2
#define TASSEL2 0x0400
#endif
#ifndef P1IE_
#define P1IE_ 0x0025
#endif
#ifndef P3SEL_
#define P3SEL_ 0x001B
#endif
#ifndef BUSY
#define BUSY 0x0001
#endif
#ifndef TIMERB1_VECTOR
#define TIMERB1_VECTOR 24
#endif
#ifndef TA0IV_
#define TA0IV_ 0x012E
#endif
#ifndef TBCCR0_
#define TBCCR0_ 0x0192
#endif
#ifndef IFG1_
#define IFG1_ 0x0002
#endif
#ifndef ADC12MEM
#define ADC12MEM ADC12MEM_
#endif
#ifndef USART1RX_VECTOR
#define USART1RX_VECTOR 6
#endif
#ifndef CCIFG
#define CCIFG 0x0001
#endif
#ifndef TBCCR1_
#define TBCCR1_ 0x0194
#endif
#ifndef TXWAKE
#define TXWAKE 0x04
#endif
#ifndef U1BR0_
#define U1BR0_ 0x007C
#endif
#ifndef MC_STOP
#define MC_STOP MC_0
#endif
#ifndef __MSP430
#define __MSP430 1
#endif
#ifndef CACTL1_
#define CACTL1_ 0x0059
#endif
#ifndef TBCCR2_
#define TBCCR2_ 0x0196
#endif
#ifndef U1BR1_
#define U1BR1_ 0x007D
#endif
#ifndef CACTL24
#define CACTL24 0x10
#endif
#ifndef CACTL25
#define CACTL25 0x20
#endif
#ifndef CACTL26
#define CACTL26 0x40
#endif
#ifndef CACTL27
#define CACTL27 0x80
#endif
#ifndef TBCCTL0_
#define TBCCTL0_ 0x0182
#endif
#ifndef TBCCR3_
#define TBCCR3_ 0x0198
#endif
#ifndef SREF_AVCC_VEREF
#define SREF_AVCC_VEREF SREF_4
#endif
#ifndef FLL_DIV_1
#define FLL_DIV_1 0x00
#endif
#ifndef FLL_DIV_2
#define FLL_DIV_2 0x01
#endif
#ifndef FLL_DIV_4
#define FLL_DIV_4 0x02
#endif
#ifndef FLL_DIV_8
#define FLL_DIV_8 0x03
#endif
#ifndef __MSP430_IVCNT__
#define __MSP430_IVCNT__ 16
#endif
#ifndef TBCCTL1_
#define TBCCTL1_ 0x0184
#endif
#ifndef TBCCR4_
#define TBCCR4_ 0x019A
#endif
#ifndef __MSP430_HAS_COMPA__
#define __MSP430_HAS_COMPA__ 
#endif
#ifndef TBCCTL2_
#define TBCCTL2_ 0x0186
#endif
#ifndef TBCCR5_
#define TBCCR5_ 0x019C
#endif
#ifndef WDTSSEL
#define WDTSSEL 0x0004
#endif
#ifndef FCTL1_
#define FCTL1_ 0x0128
#endif
#ifndef SSEL_ACLK
#define SSEL_ACLK SSEL_1
#endif
#ifndef TBCCTL3_
#define TBCCTL3_ 0x0188
#endif
#ifndef TBCCR6_
#define TBCCR6_ 0x019E
#endif
#ifndef WDTIS_0
#define WDTIS_0 0x0000
#endif
#ifndef WDTIS_1
#define WDTIS_1 0x0001
#endif
#ifndef WDTIS_2
#define WDTIS_2 0x0002
#endif
#ifndef WDTIS_3
#define WDTIS_3 0x0003
#endif
#ifndef FCTL2_
#define FCTL2_ 0x012A
#endif
#ifndef TBCCTL4_
#define TBCCTL4_ 0x018A
#endif
#ifndef FCTL3_
#define FCTL3_ 0x012C
#endif
#ifndef TBCCTL5_
#define TBCCTL5_ 0x018C
#endif
#ifndef BTSSEL
#define BTSSEL 0x80
#endif
#ifndef P1IN_
#define P1IN_ 0x0020
#endif
#ifndef BTHOLD
#define BTHOLD 0x40
#endif
#ifndef U0MCTL_
#define U0MCTL_ 0x0073
#endif
#ifndef TIMERA0_VECTOR
#define TIMERA0_VECTOR 12
#endif
#ifndef ADC12MCTL3_
#define ADC12MCTL3_ 0x0083
#endif
#ifndef CPUOFF
#define CPUOFF 0x0010
#endif
#ifndef WDTNMIES
#define WDTNMIES 0x0040
#endif
#ifndef __DEC128_MIN__
#define __DEC128_MIN__ 1E-6143DL
#endif
#ifndef __REGISTER_PREFIX__
#define __REGISTER_PREFIX__ 
#endif
#ifndef __DBL_HAS_DENORM__
#define __DBL_HAS_DENORM__ 1
#endif
#ifndef U0RXBUF_
#define U0RXBUF_ 0x0076
#endif
#ifndef SHT1_DIV128
#define SHT1_DIV128 SHT1_6
#endif
#ifndef P2OUT_
#define P2OUT_ 0x0029
#endif
#ifndef PORT1_VECTOR
#define PORT1_VECTOR 8
#endif
#ifndef ADC12SSEL_SMCLK
#define ADC12SSEL_SMCLK ADC12SSEL_3
#endif
#ifndef FRKEY
#define FRKEY 0x9600
#endif
#ifndef __MSP430_HAS_TA3__
#define __MSP430_HAS_TA3__ 
#endif
#ifndef __MSP430_HAS_PORT1__
#define __MSP430_HAS_PORT1__ 
#endif
#ifndef __NO_INLINE__
#define __NO_INLINE__ 1
#endif
#ifndef ADC12SSEL_MCLK
#define ADC12SSEL_MCLK ADC12SSEL_2
#endif
#ifndef SCCI
#define SCCI 0x0400
#endif
#ifndef P2SEL_
#define P2SEL_ 0x002E
#endif
#ifndef __FLT_MANT_DIG__
#define __FLT_MANT_DIG__ 24
#endif
#ifndef __VERSION__
#define __VERSION__ "4.5.3"
#endif
#ifndef U0BR0_
#define U0BR0_ 0x0074
#endif
#ifndef LISTEN
#define LISTEN 0x08
#endif
#ifndef WDTCTL_
#define WDTCTL_ 0x0120
#endif
#ifndef U0BR1_
#define U0BR1_ 0x0075
#endif
#ifndef UBR0_
#define UBR0_ 0x0074
#endif
#ifndef FLL_CTL0_
#define FLL_CTL0_ 0x0053
#endif
#ifndef SCG0
#define SCG0 0x0040
#endif
#ifndef SCG1
#define SCG1 0x0080
#endif
#ifndef SHT1_DIV192
#define SHT1_DIV192 SHT1_7
#endif
#ifndef UBR1_
#define UBR1_ 0x0075
#endif
#ifndef FLL_CTL1_
#define FLL_CTL1_ 0x0054
#endif
#ifndef TA0CCTL0_
#define TA0CCTL0_ 0x0162
#endif
#ifndef MC_UPTO_CCR0
#define MC_UPTO_CCR0 MC_1
#endif
#ifndef SSEL_2
#define SSEL_2 0x20
#endif
#ifndef TBSSEL0
#define TBSSEL0 0x0100
#endif
#ifndef TBSSEL1
#define TBSSEL1 0x0200
#endif
#ifndef TBSSEL2
#define TBSSEL2 0x0400
#endif
#ifndef TA0CCTL1_
#define TA0CCTL1_ 0x0164
#endif
#ifndef CAREF_0
#define CAREF_0 0x00
#endif
#ifndef CAREF_1
#define CAREF_1 0x10
#endif
#ifndef CAREF_2
#define CAREF_2 0x20
#endif
#ifndef CAREF_3
#define CAREF_3 0x30
#endif
#ifndef __IOMACROS_H_
#define __IOMACROS_H_ 
#endif
#ifndef TA0CCTL2_
#define TA0CCTL2_ 0x0166
#endif
#ifndef U0CTL_
#define U0CTL_ 0x0070
#endif
#ifndef __msp430_headers_common_h
#define __msp430_headers_common_h 
#endif
#ifndef SHT1_DIV768
#define SHT1_DIV768 SHT1_11
#endif
#ifndef UCTL_
#define UCTL_ 0x0070
#endif
#ifndef SHT1_DIV1024
#define SHT1_DIV1024 SHT1_12
#endif
#ifndef P4IN_
#define P4IN_ 0x001C
#endif
#ifndef VLDOFF
#define VLDOFF 0x00
#endif
#ifndef CARSEL
#define CARSEL 0x40
#endif
#ifndef SREF_VREF_AVSS
#define SREF_VREF_AVSS SREF_1
#endif
#ifndef ADC12_VECTOR
#define ADC12_VECTOR 14
#endif
#ifndef ADC12TOVIE
#define ADC12TOVIE 0x0004
#endif
#ifndef UCTL_0_
#define UCTL_0_ 0x0070
#endif
#ifndef TACCR0
#define TACCR0 TA0CCR0
#endif
#ifndef TACCR1
#define TACCR1 TA0CCR1
#endif
#ifndef TACCR2
#define TACCR2 TA0CCR2
#endif
#ifndef UCTL_1_
#define UCTL_1_ 0x0078
#endif
#ifndef INCH_10
#define INCH_10 10
#endif
#ifndef INCH_11
#define INCH_11 11
#endif
#ifndef INCH_12
#define INCH_12 12
#endif
#ifndef INCH_13
#define INCH_13 13
#endif
#ifndef INCH_14
#define INCH_14 14
#endif
#ifndef INCH_15
#define INCH_15 15
#endif
#ifndef SUMEXT_
#define SUMEXT_ 0x013E
#endif
#ifndef __msp430_have_port4
#define __msp430_have_port4 
#endif
#ifndef P1OUT_
#define P1OUT_ 0x0021
#endif
#ifndef OP2_
#define OP2_ 0x0138
#endif
#ifndef __DEC64_EPSILON__
#define __DEC64_EPSILON__ 1E-15DD
#endif
#ifndef CAF
#define CAF 0x02
#endif
#ifndef USART0RX_VECTOR
#define USART0RX_VECTOR 18
#endif
#ifndef SYNC
#define SYNC 0x04
#endif
#ifndef P1SEL_
#define P1SEL_ 0x0026
#endif
#ifndef OUT
#define OUT 0x0004
#endif
#ifndef CM_POS
#define CM_POS CM_1
#endif
#ifndef SHT1_DIV512
#define SHT1_DIV512 SHT1_10
#endif
#ifndef ADC12SSEL_ADC12OSC
#define ADC12SSEL_ADC12OSC ADC12SSEL_0
#endif
#ifndef __MSP430_HAS_UART1__
#define __MSP430_HAS_UART1__ 
#endif
#ifndef FSSEL_SMCLK
#define FSSEL_SMCLK FSSEL_2
#endif
#ifndef TASSEL_SMCLK
#define TASSEL_SMCLK TASSEL_2
#endif
#ifndef __SIZE_TYPE__
#define __SIZE_TYPE__ unsigned int
#endif
#ifndef __MSP430_HAS_PORT5__
#define __MSP430_HAS_PORT5__ 
#endif
#ifndef UBR00_
#define UBR00_ 0x0074
#endif
#ifndef TBCLR
#define TBCLR 0x0004
#endif
#ifndef UBR01_
#define UBR01_ 0x007C
#endif
#ifndef LCDM1_
#define LCDM1_ LCDMEM_
#endif
#ifndef U0TCTL_
#define U0TCTL_ 0x0071
#endif
